; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 359735 1 2 3 3 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph2 - mode
	image1 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation0 - direction
	Planet3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(pointing satellite0 Planet6)
	(have_image Planet3 image1)
	(have_image Planet4 image1)
	(have_image Phenomenon5 spectrograph0)
	(have_image Planet6 spectrograph2)
	(have_image Star7 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 star7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
3. (turn_to satellite0 groundstation0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite0 star7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
6. (take_image satellite0 star7 instrument0 image1)
   added: (have_image star7 image1)
   goals met: 1 of 6
7. (turn_to satellite0 planet6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet6)
   goals met: 2 of 6
8. (take_image satellite0 planet6 instrument0 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 3 of 6
9. (turn_to satellite0 planet4 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet4)
   goals met: 2 of 6
10. (take_image satellite0 planet4 instrument0 image1)
   added: (have_image planet4 image1)
   goals met: 3 of 6
11. (turn_to satellite0 planet6 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 planet6)
   goals met: 4 of 6
12. (turn_to satellite0 planet3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet3)
   goals met: 3 of 6
13. (take_image satellite0 planet3 instrument0 image1)
   added: (have_image planet3 image1)
   goals met: 4 of 6
14. (turn_to satellite0 planet6 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 planet6)
   goals met: 5 of 6
15. (turn_to satellite0 phenomenon5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 6
16. (take_image satellite0 phenomenon5 instrument0 spectrograph0)
   added: (have_image phenomenon5 spectrograph0)
   goals met: 5 of 6
17. (turn_to satellite0 planet6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet6)
   goals met: 6 of 6
